Repository: IcerOut/ColorConverter
Catalog: src/locale/*/LC_MESSAGES/gui.po
Languages: ro

source: Enter a color...
ro: Introduceți culoarea...

source: Name:
ro: Nume:

source: Generate random color
ro: Generează culoare aleatoare

source: Generate complementary color
ro: Generează culoare complementară

source: Name
ro: Nume

source: Nothing to copy!
ro: Nu există nimic de copiat!

source: Text copied to clipboard from {0} output.
ro: Text copiat în clipboard din câmpul {0}.

source: No color entered, cannot generate complement!
ro: Nicio culoare introdusă, nu se poate genera complementul!

source: Help menu
ro: Meniul ajutor

source: Using the top textbox, simply enter the desired colour.
ro: Folosind caseta text de sus, introduceți culoarea dorită.

source: The program will automatically detect the format and convert it to all
ro: Programul va detecta automat formatul, o va converti în toate

source: other options, and display the given colour.
ro: celelalte opțiuni, și o va afișa.

source: * For a normal colour, simply enter the name (with any case or formatting)
ro: * Pentru o culoare normală, introduceți doar numele (în engleză)

source: * For a hex colour, enter the long form, with or without the '#'
ro: * Pentru o culoare Hex, introduceți formatul lung, cu sau fără '#'

source: * For an RGB colour, enter the 3 numbers between 0 and 255,
ro: * Pentru o culoare RGB, introduceți cele 3 numere între 0 și 255,

source: separated by spaces or commas
ro: separate de spațiu sau virgulă

source: * For a HSL colour, enter the first number (between 0 and 360) and the two
ro: * Pentru o culoare HSL, introduceți primul număr (între 0 și 360), apoi cele 2

source: percentages (with a '%' sign or as a number between 0 and 1)
ro: procente (cu semnul '%' sau ca un număr între 0 și 1)

source: To copy one of the results, simply click on it.
ro: Pentru a copia un rezultat, dați click pe el.
